Revit 2024 API
Application.ViewsExportedByContext Event
 Subscribe to the ViewsExportedByContext event to be notified immediately after Revit has finished exporting one or more views of the document via an export context by CustomExporter.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public event EventHandler<ViewsExportedByContextEventArgs> ViewsExportedByContext
Visual Basic
Public Event ViewsExportedByContext As EventHandler(Of ViewsExportedByContextEventArgs)
Visual C++
public:
 event EventHandler<ViewsExportedByContextEventArgs^>^ ViewsExportedByContext {
	void add (EventHandler<ViewsExportedByContextEventArgs^>^ value);
	void remove (EventHandler<ViewsExportedByContextEventArgs^>^ value);
}
Remarks
This event is raised immediately after Revit has finished exporting views of the document via an export context by CustomExporter.
It is raised even when view exporting via export context by CustomExporter failed.
 Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action was successful or not.
This event is not cancellable, for the process of view exporting by CustomExporter has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Close() and similar overloads.
Exception InvalidOperationException will be thrown if any of the above methods is called during this event.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace